Tekla Open API Reference for Tekla Structures 2025
WpfReinforcementCatalog Methods
The WpfReinforcementCatalog type exposes the following members.
Methods
Name | Description
InitializeComponent
 InitializeComponent
OnValueChanged
 Event handler for passing generic catalog data back to dialog
Top
See Also
Reference
WpfReinforcementCatalog Class
Tekla.Structures.Dialog.UIControls Namespace